print('''
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    @                                     @
    @   vultr 搭建专用 木木小方方 2018-01-30  @
    @                                     @
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    @                                     @
    @声明:                                 @
    @   本脚本仅供学习，以及在不违反中华人民共和国 @
    @ 法律下使用，切勿违反中华人民共和国法律。     @
    @                                     @
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    @ ShadowSocks配置（备用，一般不用）        @
    @    加密方式    aes-256-cfb            @
    @       端口    8842                   @
    @-------------------------------------@
    @ ShadowSocksR配置                     @
    @       协议    auth_aes128_md5        @
    @    加密方式    aes-128-ctr            @
    @    混淆方式    tls1.2_ticket_auth     @
    @       端口    自行设置                 @
    @-------------------------------------@
    @将会安装：                             @
    @      @ ShadowSocks  (python版)     。@
    @      @ ShadowSocksR (python版）      @
    @      @ Google BBR 加速               @
    @-------------------------------------@
    @注意事项:                              @
    @      端口要用空格分开  如:233 666       @
    @      有时候需要重启一遍服务器才能完成加速安装@
    @      请耐心等待，后按Y重启               @
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    ''')